sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
/**
 ****************************************************************************************
 *
 * @file arch_system.c
 *
 * @brief System setup.
 *
 * Copyright (C) 2012-2025 Renesas Electronics Corporation and/or its affiliates.
 * All rights reserved. Confidential Information.
 *
 * This software ("Software") is supplied by Renesas Electronics Corporation and/or its
 * affiliates ("Renesas"). Renesas grants you a personal, non-exclusive, non-transferable,
 * revocable, non-sub-licensable right and license to use the Software, solely if used in
 * or together with Renesas products. You may make copies of this Software, provided this
 * copyright notice and disclaimer ("Notice") is included in all such copies. Renesas
 * reserves the right to change or discontinue the Software at any time without notice.
 *
 * THE SOFTWARE IS PROVIDED "AS IS". RENESAS DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE
 * MAXIMUM EXTENT PERMITTED UNDER LAW, IN NO EVENT SHALL RENESAS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE, EVEN IF RENESAS HAS BEEN ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGES. USE OF THIS SOFTWARE MAY BE SUBJECT TO TERMS AND CONDITIONS CONTAINED IN
 * AN ADDITIONAL AGREEMENT BETWEEN YOU AND RENESAS. IN CASE OF CONFLICT BETWEEN THE TERMS
 * OF THIS NOTICE AND ANY SUCH ADDITIONAL LICENSE AGREEMENT, THE TERMS OF THE AGREEMENT
 * SHALL TAKE PRECEDENCE. BY CONTINUING TO USE THIS SOFTWARE, YOU AGREE TO THE TERMS OF
 * THIS NOTICE.IF YOU DO NOT AGREE TO THESE TERMS, YOU ARE NOT PERMITTED TO USE THIS
 * SOFTWARE.
 *
 ****************************************************************************************
 */

/*
 * INCLUDES
 ****************************************************************************************
 */

#include <stdint.h>
#include <stdlib.h>
#include <stddef.h>
#include <stdbool.h>
#include "datasheet.h"
#include "arch.h"
#include "arch_api.h"
#include "arch_wdg.h"
#include "arch_system.h"
#include "gpio.h"
#include "hw_otpc.h"
#include "otp_hdr.h"
#include "user_periph_setup.h"

#if !defined (__NON_BLE_EXAMPLE__)
#include "user_callback_config.h"
#include "rwip.h"     // BLE initialization
#include "llc.h"
#include "gtl_env.h"
#include "gtl_task.h"
#include "gap_cfg.h"
#include "co_math.h"
#include "system_library.h"
#include "nvds.h"
#include "app.h"
#include "rwble.h"
#include "da1458x_scatter_config.h"
#include "arch_rom.h"
#if defined (__DA14531__)
#include "rf_531.h"
#else
#include "rf_585.h"
#endif
#endif // (__NON_BLE_EXAMPLE__)

#if (USE_TRNG)
#include "trng.h"       // True random number generator API
#endif

#if defined (__DA14531__)
#include "adc.h"
#include "otp_cs.h"
#include "syscntl.h"
#endif

#if (USE_RANGE_EXT)
#include "range_ext_api.h"
#include "sky66111.h"
#endif

#if ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT)) // external wake up, only in full embedded designs
#include "wkupct_quadec.h"
#endif

#if defined (__DA14586__)
#include "spi_flash.h"
#endif

/*
 * DEFINES
 ****************************************************************************************
 */

#if !defined (__NON_BLE_EXAMPLE__)
#if (USE_RF_LDO_CALIBRATION)
extern bool rf_ldo_calibration_pending;
#endif

#ifndef CFG_CALIBRATION_TEMP_DIFF
  #ifdef CFG_RF_LDO_CALIBRATION
    #define CFG_CALIBRATION_TEMP_DIFF           (5)
  #else
    #define CFG_CALIBRATION_TEMP_DIFF           (8)
  #endif
#endif

#if (USE_XTAL32M_DYN_FREQ_TRIMMING)
#ifndef CFG_XTAL32M_TRIM_TEMP_DIFF
#define CFG_XTAL32M_TRIM_TEMP_DIFF          (5)
#endif
#endif
#endif

/// Watchdog behavior at value 0 in production mode
#if (DEVELOPMENT_DEBUG == 0)
#if defined (CFG_WDG_TRIGGER_HW_RESET_IN_PRODUCTION_MODE)
#define USER_WDG_CFG                         (1)
#else
#define USER_WDG_CFG                         (0)
#endif
#else
#define USER_WDG_CFG                         (0)
#endif

uint16_t clk_freq_trim_reg_value        __SECTION_ZERO("retention_mem_area0");

// Required DA14531-01, DA14535 ROM symbols
#if defined (__NON_BLE_EXAMPLE__)
#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
extern void set_xtal32m_trim_value_ROM(uint16_t trim_value);
#endif
#endif

#if !defined (__NON_BLE_EXAMPLE__)

/**
 * @addtogroup DRIVERS
 * @{
 */

bool sys_startup_flag __SECTION_ZERO("retention_mem_area0");

// Delay sleep entrance at system startup
volatile uint32_t startup_sleep_delay = STARTUP_SLEEP_DELAY_DEFAULT;

#if defined (__DA14531__)
/// Last temperature read from the die temperature sensor through GPADC
int8_t rf_cal_last_temp    __SECTION_ZERO("retention_mem_area0");
/// Radio calibration counter increasing by one just before calibration runs
static uint32_t rf_cal_count __SECTION_ZERO("retention_mem_area0");
#if (USE_XTAL32M_DYN_FREQ_TRIMMING)
/* 
 Note: The values in the tables do not depend on the ICs but on the crystals(XTAL32M) connected to the ICs.
 Therefore if the crystal changes, the values below should change as well. Please refer to the schematics of the 
 DA14533/DA14535 daughterboards to view the exact part number of the crystals, for which these values have been calculated.
*/
#if defined(__DA14533__)
const int16_t trimfit_dt[] = {2189, 2923, 2773, 1906, 643, -668, -1678, -2431, -2820, -2833, -2274, -958, 1933, 6586};
static const int8_t trim_delta = 5;
static const int16_t adc_min = -140;
#elif defined(__DA14535__)
static const int16_t trimfit_dt[] = {-429, 89, 494, 777, 853, 791, 647, 439, 213, -21, -259, -501, -750, -982, -1179, -1321, -1310, -1158, -855, -386, 319, 1305, 2497}; 
static const int8_t trim_delta = 4;
static const int16_t adc_min = -149;
#endif // __DA14533__
int8_t xtal32m_trim_last_temp   __SECTION_ZERO("retention_mem_area0");
#endif
#else
uint16_t last_temp_count    __SECTION_ZERO("retention_mem_area0"); // temperature counter
#endif

uint32_t last_time          __SECTION_ZERO("retention_mem_area0"); // time of last temperature count measurement

