sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
extern uint32_t lld_sleep_us_2_lpcycles_func(uint32_t us);
extern uint32_t lld_sleep_lpcycles_2_us_func(uint32_t lpcycles);

extern void ble_init(uint32_t base);
extern void rf_recalibration(void);

uint32_t lp_clk_sel                 __SECTION_ZERO("retention_mem_area0");   //low power clock selection
uint8_t rcx_cal_in_progress         __SECTION_ZERO("retention_mem_area0");
uint8_t force_rf_cal                __SECTION_ZERO("retention_mem_area0");
rcx_time_data_t rcx_time_data       __SECTION_ZERO("retention_mem_area0");

#if (RCX_MEASURE_ENABLED)
rcx_stats_data_t rcx_stats_data     __SECTION_ZERO("retention_mem_area0");
#endif

#if defined (__DA14531__)
    #define RCX_PERIOD_CORRECTION_FACTOR_IN_PPM     0

    // Definitions for RCX correction
    #define RCX_COR_MULTIPLIER                  ((uint32_t) (1024*1024))
    #define RCX_COR_SCALED_PPM                  ((uint16_t) (RCX_PERIOD_CORRECTION_FACTOR_IN_PPM * RCX_COR_MULTIPLIER / 1000000))
    #define RCX_COR_DIVIDER                     ((uint64_t) (RCX_COR_MULTIPLIER + RCX_COR_SCALED_PPM))

    #if (RCX_PERIOD_CORRECTION_FACTOR_IN_PPM > 0)
        #define RCX_SLOT_DURATION_FACTOR        (((uint64_t) (625 * 16 * RCX_CALIB_TIME) * RCX_COR_MULTIPLIER << 20) / RCX_COR_DIVIDER)
        #define RCX_PERIOD_FACTOR               ((uint32_t) (((uint64_t) (RCX_COR_DIVIDER) * 64 << 15) / (RCX_CALIB_TIME * RCX_COR_MULTIPLIER)))
    #else
        #define RCX_SLOT_DURATION_FACTOR        ((uint64_t) (625 * 16 * RCX_CALIB_TIME ) << 20)
        #define RCX_PERIOD_FACTOR               (((uint32_t) (64 << 15) / (RCX_CALIB_TIME)))
    #endif
#endif

#ifndef USE_ARCH_WKUPCT_DEB_TIME
#define USE_ARCH_WKUPCT_DEB_TIME
uint16_t arch_wkupct_deb_time           __SECTION_ZERO("retention_mem_area0"); // Wakeup timer debouncing time
#endif

/// Device BD address in OTP header
struct bd_addr dev_bdaddr               __SECTION_ZERO("retention_mem_area0");

uint16_t iq_trim_bias_ctrl1_reg         __SECTION_ZERO("retention_mem_area0");
uint16_t iq_trim_rf_mixer_ctrl1_reg     __SECTION_ZERO("retention_mem_area0");

// Heap logging structs
struct mem_usage_log heap_usage_env     __SECTION_ZERO("retention_mem_area0");
struct mem_usage_log heap_usage_db      __SECTION_ZERO("retention_mem_area0");
struct mem_usage_log heap_usage_msg     __SECTION_ZERO("retention_mem_area0");
struct mem_usage_log heap_usage_nonRet  __SECTION_ZERO("retention_mem_area0");

#if (USE_XTAL16M_ADAPTIVE_SETTLING && USE_POWER_OPTIMIZATIONS)
    extern uint32_t twirq_set_min;
    extern uint32_t twirq_set;
    extern uint32_t twirq_set_max;
#endif

#if defined (__DA14531__)
uint16_t xtal_wait_trim      __SECTION_ZERO("retention_mem_area0");
uint32_t twirq_set_value;
uint32_t twirq_reset_value;
#endif

#if defined (__DA14531__) && (USE_TRNG)
uint32_t otp_hdr_timestamp = 0;
#endif

// Required DA14531-01, DA14535 ROM symbols
#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
extern void init_pwr_and_clk_ble_part_start_ROM(void);
extern void init_pwr_and_clk_ble_part_xtal32k_ROM(void);
extern void init_pwr_and_clk_ble_part_rcx_ROM(void);
extern void init_pwr_and_clk_ble_part_end_ROM(void);
extern void calc_rcx_freq_ROM(rcx_time_data_t *ptr_rcx_time_data);
extern void calc_rcx_freq_stas_ROM(rcx_time_data_t *ptr_rcx_time_data, rcx_stats_data_t *ptr_rcx_stats_data);
extern uint8_t check_sys_startup_period_ROM(bool *ptr_sys_startup_flag, uint32_t startup_sleep_delay);
extern void set_xtal32m_trim_value_ROM(uint16_t trim_value);
#endif

/*
 * FUNCTION DEFINITIONS
 ****************************************************************************************
 */

/**
 ****************************************************************************************
 * @brief Select low power clock.
 * @note function store_low_power_clock() handles the case where CFG_LP_CLK = LP_CLK_FROM_OTP.
 ****************************************************************************************
 */
static void select_lp_clk(void)
{
    if (CFG_LP_CLK != LP_CLK_FROM_OTP)
    {
        lp_clk_sel = CFG_LP_CLK;
    }
}

/**
 ****************************************************************************************
 * @brief Store low power clock selection from OTP.
 ****************************************************************************************
 */
#if defined (CFG_LP_CLK) && (CFG_LP_CLK == LP_CLK_FROM_OTP)
static void store_low_power_clock(void)
{
#if defined (__DA14531__)
    lp_clk_sel = otp_cs_get_low_power_clock();
#else
    lp_clk_sel = GetWord32(OTP_HDR_SLEEP_CLK_SOURCE_ADDR);
#endif
}
#endif

/**
 ****************************************************************************************
 * @brief Initialisation of ble core, pwr and clk
 *
 * The Hclk and Pclk are set
 ****************************************************************************************
 */
#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
void init_pwr_and_clk_ble(void)
{
    init_pwr_and_clk_ble_part_start_ROM();

    select_lp_clk();

    if (arch_clk_is_XTAL32())
    {
        init_pwr_and_clk_ble_part_xtal32k_ROM();
    }
    else if (arch_clk_is_RCX20())
    {
        init_pwr_and_clk_ble_part_rcx_ROM();
#if defined (__DA14535__)
        SetBits16(CLK_RCX_REG, RCX_BIAS, 0xE);
#endif
    }
    else
    {
        ASSERT_WARNING(0);
    }

    init_pwr_and_clk_ble_part_end_ROM();
}
#else
void init_pwr_and_clk_ble(void)
{
    SetBits16(CLK_RADIO_REG, BLE_DIV, 0);
    SetBits16(CLK_RADIO_REG, BLE_ENABLE, 1);
#if !defined (__DA14531__)
    SetBits16(CLK_RADIO_REG, RFCU_DIV, 1);
#endif
    SetBits16(CLK_RADIO_REG, RFCU_ENABLE, 1);

    /*
     * Power up BLE core & reset BLE Timers
     */
#if defined (__DA14531__)
    SetBits16(CLK_RC32K_REG, RC32K_DISABLE, 0);
    SetBits16(CLK_CTRL_REG, LP_CLK_SEL, 0);
#else
    SetBits16(CLK_32K_REG,  RC32K_ENABLE, 1);
    SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 0);
#endif

    SetBits16(CLK_RADIO_REG, BLE_LP_RESET, 1);
    SetBits16(PMU_CTRL_REG, RADIO_SLEEP, 0);
    while (!(GetWord16(SYS_STAT_REG) & RAD_IS_UP)); // Just wait for radio to truely wake up

