sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
    select_lp_clk();

    if ( arch_clk_is_XTAL32( ) )
    {
#if defined (__DA14531__)
#if !defined (__DA14535__)
    SetBits16(GP_DATA_REG, P03_P04_FILT_DIS, 1);    // Disable RC input filter for P0_3 and P0_4
#endif
    SetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE, 1);  // Enable XTAL32KHz
#else
    SetBits16(CLK_32K_REG, XTAL32K_ENABLE, 1);      // Enable XTAL32KHz
#endif

#if !defined (__DA14531__)
    // Disable XTAL32K amplitude regulation in BOOST mode
    if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
    {
        SetBits16(CLK_32K_REG,  XTAL32K_DISABLE_AMPREG, 1);
    }
    else
    {
        SetBits16(CLK_32K_REG,  XTAL32K_DISABLE_AMPREG, 0);
    }
#endif

#if defined (__DA14531__)
        SetBits16(CLK_XTAL32K_REG, XTAL32K_CUR, 5);
        SetBits16(CLK_XTAL32K_REG, XTAL32K_RBIAS, 3);
        SetBits16(CLK_CTRL_REG, LP_CLK_SEL, 2);    // Select XTAL32K as LP clock
#else
        SetBits16(CLK_32K_REG, XTAL32K_CUR, 5);
        SetBits16(CLK_32K_REG, XTAL32K_RBIAS, 3);
        SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 1);  // Select XTAL32K as LP clock
#endif

    }
    else if ( arch_clk_is_RCX20( ) )
    {
#if defined (__DA14531__)
    #if defined (__DA14535__)
        SetBits16(CLK_RCX_REG, RCX_BIAS, 0xE);
    #else
        SetBits16(CLK_RCX_REG, RCX_BIAS, 0xB);
    #endif
        SetBits16(CLK_RCX_REG, RCX_ENABLE, 1);
        SetBits16(CLK_CTRL_REG, LP_CLK_SEL, 1);        // Select RCX as LP clock
        SetBits16(CLK_XTAL32K_REG, XTAL32K_ENABLE, 0); // Disable XTAL32K
#else
        SetBits16(CLK_RCX20K_REG, RCX20K_NTC, 0xB);
        SetBits16(CLK_RCX20K_REG, RCX20K_BIAS, 0);
        SetBits16(CLK_RCX20K_REG, RCX20K_TRIM, 0);
        SetBits16(CLK_RCX20K_REG, RCX20K_LOWF, 1);
        SetBits16(CLK_RCX20K_REG, RCX20K_ENABLE, 1);
        SetBits16(CLK_RCX20K_REG, RCX20K_SELECT, 1);
        SetBits16(SYS_CTRL_REG, CLK32_SOURCE, 0);
        SetBits16(CLK_32K_REG, XTAL32K_ENABLE, 0);     // Disable XTAL32K
#endif
    }
    else
    {
        ASSERT_WARNING(0);
    }

#if !defined (__DA14531__)
    SetBits16(CLK_32K_REG,  RC32K_ENABLE, 0);      // Disable RC32K
#endif

    SetBits16(CLK_RADIO_REG, BLE_LP_RESET, 0);

#if !defined (__DA14531__)
    if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
    {
        SetWord16(DCDC_CTRL3_REG, 0x5);
    }
#endif

    /*
     * Just make sure that BLE core is stopped (if already running)
     */
    SetBits32(BLE_RWBLECNTL_REG, RWBLE_EN, 0);

    /*
     * Since BLE is stopped (and powered), set CLK_SEL
     */
    SetBits32(BLE_CNTL2_REG, BLE_CLK_SEL, 16);
    SetBits32(BLE_CNTL2_REG, BLE_RSSI_SEL, 1);
}
#endif // __EXCLUDE_ROM_ARCH_SYSTEM__

void calibrate_rcx20(uint16_t cal_time)
{
    if ((CFG_LP_CLK == LP_CLK_FROM_OTP) || (CFG_LP_CLK == LP_CLK_RCX20))
    {
        SetWord16(CLK_REF_CNT_REG, cal_time);
        SetBits16(CLK_REF_SEL_REG, REF_CLK_SEL, 0x3); //RCX select
        SetBits16(CLK_REF_SEL_REG, REF_CAL_START, 0x1); //Start Calibration
        rcx_cal_in_progress = 1;
    }
}

#if defined (__DA14531__)
void read_rcx_freq(bool wait_for_calibration)
{
    if (rcx_cal_in_progress && ((CFG_LP_CLK == LP_CLK_FROM_OTP) || (CFG_LP_CLK == LP_CLK_RCX20)))
    {
        if (wait_for_calibration)
        {
            while (GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1);
        }
        else
        {
            if (GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1)
            {
                return;
            }
        }

        rcx_cal_in_progress = 0;

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
        calc_rcx_freq_ROM(&rcx_time_data);
#else
        uint32_t high = GetWord16(CLK_REF_VAL_H_REG);
        uint32_t low = GetWord16(CLK_REF_VAL_L_REG);
        uint32_t value = (high << 16) + low;

        // Calculate RCX period
        rcx_time_data.rcx_period = (((uint32_t) ((value * RCX_PERIOD_FACTOR) >> 14) + 1) >> 1);
        // Calculate RCX slot duration
        rcx_time_data.rcx_slot_duration = (RCX_SLOT_DURATION_FACTOR / value);
        // Calculate RCX frequency. (1000000 / 625 >> 20) is equal to (100 >> 16)
        rcx_time_data.rcx_freq = (((uint32_t) rcx_time_data.rcx_slot_duration) * 100) >> 16;
#endif // __EXCLUDE_ROM_ARCH_SYSTEM__

#if (RCX_MEASURE_ENABLED)
#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
        calc_rcx_freq_stas_ROM(&rcx_time_data, &rcx_stats_data)
#else
        if (rcx_stats_data.rcx_period_last)
        {
            int diff = rcx_stats_data.rcx_period_last - rcx_time_data.rcx_period;
            if (abs(diff) > rcx_stats_data.rcx_period_diff)
            {
                rcx_stats_data.rcx_period_diff = abs(diff);
            }
        }
        rcx_stats_data.rcx_period_last = rcx_time_data.rcx_period;

        if (rcx_stats_data.rcx_freq_min == 0)
        {
            rcx_stats_data.rcx_freq_min = rcx_time_data.rcx_freq;
            rcx_stats_data.rcx_freq_max = rcx_time_data.rcx_freq;
        }

        if (rcx_time_data.rcx_freq < rcx_stats_data.rcx_freq_min)
        {
            rcx_stats_data.rcx_freq_min = rcx_time_data.rcx_freq;
        }
        else if (rcx_time_data.rcx_freq > rcx_stats_data.rcx_freq_max)
        {
            rcx_stats_data.rcx_freq_max = rcx_time_data.rcx_freq;
        }
#endif // __EXCLUDE_ROM_ARCH_SYSTEM__
#endif // RCX_MEASURE_ENABLED
    }
}

#else
void read_rcx_freq(uint16_t cal_time)
{
    if ( (rcx_cal_in_progress) && ((CFG_LP_CLK == LP_CLK_FROM_OTP) || (CFG_LP_CLK == LP_CLK_RCX20)) )
    {
        while(GetBits16(CLK_REF_SEL_REG, REF_CAL_START) == 1);
        uint32_t high = GetWord16(CLK_REF_VAL_H_REG);
        uint32_t low = GetWord16(CLK_REF_VAL_L_REG);
        uint32_t value = ( high << 16 ) + low;

#ifdef RCX_PERIOD_CORRECTION_FACTOR_IN_PPM
        uint32_t f = ((uint64_t)16000000 * cal_time) * 1000000 / (1000000 + RCX_PERIOD_CORRECTION_FACTOR_IN_PPM) / value  ;
#else
        uint32_t f = (16000000 * cal_time) / value;
#endif

        rcx_cal_in_progress = 0;

        rcx_time_data.rcx_freq = f;

#ifdef RCX_PERIOD_CORRECTION_FACTOR_IN_PPM
        rcx_time_data.rcx_period = ((uint64_t)64 * value) * (1000000 + RCX_PERIOD_CORRECTION_FACTOR_IN_PPM) / 1000000 / cal_time;
#else
        rcx_time_data.rcx_period = (64 * value) / cal_time;
#endif

        rcx_time_data.rcx_slot_duration = 625 * cal_time * 16;

#ifdef RCX_PERIOD_CORRECTION_FACTOR_IN_PPM
        rcx_time_data.rcx_slot_duration = (rcx_time_data.rcx_slot_duration << 20) * 1000000 / (1000000 + RCX_PERIOD_CORRECTION_FACTOR_IN_PPM);
#else
        rcx_time_data.rcx_slot_duration = rcx_time_data.rcx_slot_duration << 20;
#endif

        rcx_time_data.rcx_slot_duration = rcx_time_data.rcx_slot_duration / value;

#if (RCX_MEASURE_ENABLED)
        if (rcx_stats_data.rcx_period_last)
        {
            int diff = rcx_stats_data.rcx_period_last - rcx_time_data.rcx_period;
            if (abs(diff) > rcx_stats_data.rcx_period_diff)
                rcx_stats_data.rcx_period_diff = abs(diff);
        }
        rcx_stats_data.rcx_period_last = rcx_time_data.rcx_period;

        if (rcx_stats_data.rcx_freq_min == 0)
        {
            rcx_stats_data.rcx_freq_min = rcx_time_data.rcx_freq;
            rcx_stats_data.rcx_freq_max = rcx_time_data.rcx_freq;
        }
        if (rcx_time_data.rcx_freq < rcx_stats_data.rcx_freq_min)
            rcx_stats_data.rcx_freq_min = rcx_time_data.rcx_freq;
        else if (rcx_time_data.rcx_freq > rcx_stats_data.rcx_freq_max)
            rcx_stats_data.rcx_freq_max = rcx_time_data.rcx_freq;
#endif
    }
}
#endif

void set_sleep_delay(void)
{
    int16_t delay;

#if defined (__DA14531__)
    extern struct arch_sleep_env_tag    sleep_env;

    uint16_t xtal_wait_trim_usec = otp_cs_get_xtal32m_wait_trim();
    xtal_wait_trim = lld_sleep_us_2_lpcycles_sel_func(xtal_wait_trim_usec);

    if (arch_clk_is_RCX20())
    {
        // TWIRQ_RESET in LP clock cycles (time to reset BLE_WAKEUP_LP IRQ before SLP IRQ assertion)
        // Extra LP clock cycles: 1 due to calibration circuit, 2 to read SLP IRQ status, 1 for margin
        twirq_reset_value = 4 + lld_sleep_us_2_lpcycles_sel_func(RCX_BLE_PWR_UP_TO_SLP_IRQ_USEC + xtal_wait_trim_usec);

        // TWIRQ_SET in LP clock cycles (time to set BLE_WAKEUP_LP IRQ before SLP IRQ assertion)
        twirq_set_value = HW_STARTUP_TIME_IN_RCX_CYCLES + xtal_wait_trim + twirq_reset_value;
    }
    else if (arch_clk_is_XTAL32())
    {
        // TWIRQ_RESET in LP clock cycles (time to reset BLE_WAKEUP_LP IRQ before SLP IRQ assertion)
        // Extra LP clock cycles: 1 due to calibration circuit, 2 to read SLP IRQ status, 1 for margin
        twirq_reset_value = 4 + lld_sleep_us_2_lpcycles_sel_func(XTAL32K_BLE_PWR_UP_TO_SLP_IRQ_USEC + xtal_wait_trim_usec);

        // TWIRQ_SET in LP clock cycles (time to set BLE_WAKEUP_LP IRQ before SLP IRQ assertion)
        twirq_set_value = HW_STARTUP_TIME_IN_XTAL32K_CYCLES + xtal_wait_trim + twirq_reset_value;
    }

    if (sleep_env.slp_state == ARCH_EXT_SLEEP_OTP_COPY_ON)
    {
        if (arch_clk_is_RCX20())
        {
            twirq_set_value += RCX_OTP_COPY_OVERHEAD;
        }
        else if (arch_clk_is_XTAL32())
        {
            twirq_set_value += XTAL32_OTP_COPY_OVERHEAD;
        }
    }

