sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
    delay = lld_sleep_lpcycles_2_us_sel_func(twirq_set_value) + MINIMUM_SLEEP_DURATION;
#else // DA14585/DA14586
#if (USE_POWER_OPTIMIZATIONS)
#if (USE_XTAL16M_ADAPTIVE_SETTLING)
    delay = 0;
    if (twirq_set > 87)
        delay = (twirq_set - 87);

    delay = (delay/2) * 61;
    if (delay%2 != 0)
        delay += 31;
    delay = co_max(delay, MINIMUM_SLEEP_DURATION);
#else
    delay = MINIMUM_SLEEP_DURATION;

    // if XTAL_TRIMMING_TIME_USEC changes (i.e. gets larger) then this
    // will make sure that the user gets notified to increase "delay" by 1 or more
    // slots so there's enough time for XTAL to settle
    # if ( (3125 + (MINIMUM_SLEEP_DURATION + 625)) < (LP_ISR_TIME_USEC + 1100)) //1.1ms max power-up time
    # error "Minimum sleep duration is too small for the 16MHz crystal used..."
    # endif
#endif // USE_XTAL16M_ADAPTIVE_SETTLING

#else // !USE_POWER_OPTIMIZATIONS
    uint32_t sleep_delay;

    delay = 0;

    if ( arch_clk_is_RCX20() )
    {
        if (rcx_time_data.rcx_period > (RCX_PERIOD_MAX << 10) )
            ASSERT_ERROR(0);

        sleep_delay = SLP_PROC_TIME + SLEEP_PROC_TIME + (4 * RCX_PERIOD_MAX); // 400
    }
    else
    {
        sleep_delay = /*SLP_PROC_TIME + SLEEP_PROC_TIME + */(4 * XTAL32_PERIOD_MAX); // ~200
    }

    // Actual "delay" is application specific and is the execution time of the BLE_WAKEUP_LP_Handler(), which depends on XTAL trimming delay.
    // In case of OTP copy, this is done while the XTAL is settling. Time unit of delay is usec.
    delay += XTAL_TRIMMING_TIME_USEC;
    // Increase time taking into account the time from the setting of DEEP_SLEEP_ON until the assertion of DEEP_SLEEP_STAT.
    delay += sleep_delay;
    // Add any application specific delay
    delay += APP_SLEEP_DELAY_OFFSET;
#endif // USE_POWER_OPTIMIZATIONS
#endif // defined (__DA14531__)

    rwip_wakeup_delay_set(delay);
}

#if !defined (__DA14531__)
uint16_t get_rc16m_count(void)
{
    uint16_t count;

    uint16_t trim = GetBits16(CLK_16M_REG, RC16M_TRIM); // save trim value

    SetBits16(CLK_16M_REG, RC16M_ENABLE, 1);
    SetBits16(CLK_16M_REG, RC16M_TRIM, 0x0);

    SetWord16(CLK_REF_CNT_REG, RC16_CAL_REF_CYCLES);    // Preset reference cycles to 1024
    SetWord16(CLK_REF_SEL_REG, 0x0005);                 // Select RC16M and start counting

    while (GetWord16(CLK_REF_SEL_REG) & 0x0004);

    count = GetWord16(CLK_REF_VAL_L_REG);               // Read back number of XTAL16M cycles

    SetBits16(CLK_16M_REG, RC16M_TRIM, 0xA);
    SetBits16(CLK_16M_REG, RC16M_ENABLE, 0);

    SetBits16(CLK_16M_REG, RC16M_TRIM, trim);           // restore trim value

    return count;
}
#endif

#if (USE_XTAL32M_DYN_FREQ_TRIMMING)
static uint8_t xtal32m_calc_trim(uint16_t adc_val)
{
    int32_t result;
    int16_t adc_val_i;
    int16_t i;
    int16_t adc_low_val;

    uint16_t adc_val_rt = otp_cs_get_adc_25_cal();
    if (adc_val_rt == 0)
    {
        // OTP calibration value is not present - use typical value instead
        adc_val_rt = DEFAULT_TEMPERATURE_CAL_VAL;
    }
    adc_val_i = ((adc_val - adc_val_rt) >> 6);

    // the x-axis is a list which starts with adc_min and increments with 1<<trim_delta
    // find the index in the list
    i = (adc_val_i - adc_min) >> trim_delta;
    if (i < 0)
    {
        i = 0;
    }

    // interpolate between (or beyond) index i and index i+1, therefore we should never use the last index:
    if (i > ((sizeof(trimfit_dt) / 2) - 2))
    {
        i = (sizeof(trimfit_dt) / 2) - 2;
    }

    // Low x-value from which we interpolate
    adc_low_val = adc_min + i * (1 << trim_delta);

    // interpolate:
    result = trimfit_dt[i + 1] - trimfit_dt[i];         // delta-y
    result *= (adc_val_i - adc_low_val);                // delta-x
    result = result >> trim_delta;                      // divide by step-size
    result += trimfit_dt[i];                            // add low-side y-value
    result = result >> 6;                               // divide by 64 (trimfit_dt was multiplied by 64, to get sensible integers)
    result += otp_cs_get_xtal32m_trim_value();          // add room-temp trimvalue

    // sanitize output:
    if (result > 255)
    {
        result = 255;
    }

    if (result < 0)
    {
        result = 0;
    }

    return (uint8_t) result;
}
#endif // USE_XTAL32M_DYN_FREQ_TRIMMING

void conditionally_run_radio_cals(void)
{
#if !defined (__FPGA__)
#if defined (__DA14531__)
    // 531 case
    uint32_t current_time = lld_evt_time_get();

    if (current_time < last_time)
    {
        last_time = 0;
    }

#if (USE_RF_LDO_CALIBRATION)
    if (((current_time - last_time) >= 3200) || rf_ldo_calibration_pending)
#else
    if ((current_time - last_time) >= 3200) //2 sec
#endif
    {
#if (USE_RF_LDO_CALIBRATION)
        if (rf_ldo_calibration_pending)
        {
            rf_cal_count++;
            rf_recalibration();
        }
        else
#endif
        {
            last_time = current_time;
            // Store the current content of the following registers:
            // - GP_ADC_CTRL_REG,
            // - GP_ADC_CTRL2_REG,
            // - GP_ADC_CTRL3_REG,
            // - GP_ADC_SEL_REG.
            uint16_t tmp_adc_ctrl_reg  = GetWord16(GP_ADC_CTRL_REG);
            uint16_t tmp_adc_ctrl2_reg = GetWord16(GP_ADC_CTRL2_REG);
            uint16_t tmp_adc_ctrl3_reg = GetWord16(GP_ADC_CTRL3_REG);
            uint16_t tmp_adc_sel_reg   = GetWord16(GP_ADC_SEL_REG);

            adc_config_t cfg =
            {
                .input_mode = ADC_INPUT_MODE_SINGLE_ENDED,
                .input      = ADC_INPUT_SE_TEMP_SENS,
                .continuous = false
            };

            // Initialize and enable ADC
            adc_init(&cfg);

            adc_store_offsets();
            adc_reset_offsets();

            int8_t current_temp = adc_get_temp();
#if (USE_XTAL32M_DYN_FREQ_TRIMMING)
            uint16_t adc_raw_val = adc_get_sample();
#endif
            adc_load_offsets();

            if (rf_cal_last_temp == 127)
            {
                rf_cal_last_temp = current_temp;
            }
            else
            {
                int8_t calibration_temp_diff = current_temp - rf_cal_last_temp;

                if (calibration_temp_diff < 0)
                {
                    calibration_temp_diff = -calibration_temp_diff;
                }

                if (calibration_temp_diff >= CFG_CALIBRATION_TEMP_DIFF)
                {
                    // Calibrate the RF if the temperature difference is greater than
                    // (or equal to) CFG_CALIBRATION_TEMP_DIFF degrees Celsius
                    rf_cal_count++;
                    rf_recalibration();
                    rf_cal_last_temp = current_temp;
                }
            }
#if (USE_XTAL32M_DYN_FREQ_TRIMMING)
            if (xtal32m_trim_last_temp == 127)
            {
                xtal32m_trim_last_temp = current_temp;
            }
            else
            {
                int8_t xtal32m_trim_temp_diff = current_temp - xtal32m_trim_last_temp;

                if (xtal32m_trim_temp_diff < 0)
                {
                    xtal32m_trim_temp_diff = -xtal32m_trim_temp_diff;
                }

                if (xtal32m_trim_temp_diff >= CFG_XTAL32M_TRIM_TEMP_DIFF)
                {
                    clk_freq_trim_reg_value = xtal32m_calc_trim(adc_raw_val);
                    // Apply Trim value
                    SetWord16(CLK_FREQ_TRIM_REG, clk_freq_trim_reg_value);
                    xtal32m_trim_last_temp = current_temp;
                }
            }
#endif // USE_XTAL32M_DYN_FREQ_TRIMMING

            // Restore the content of the ADC CTRL and SEL registers
            SetWord16(GP_ADC_CTRL2_REG, tmp_adc_ctrl2_reg);
            SetWord16(GP_ADC_CTRL3_REG, tmp_adc_ctrl3_reg);
            SetWord16(GP_ADC_SEL_REG, tmp_adc_sel_reg);
            SetWord16(GP_ADC_CTRL_REG, tmp_adc_ctrl_reg);
        }
    }
#else
    // 585/586 case
    uint16_t count, count_diff;

    bool rf_cal_stat;

    uint32_t current_time = lld_evt_time_get();

    if (current_time < last_time)
    {
        last_time = 0;
    }

    if (force_rf_cal)
    {
        force_rf_cal = 0;

