sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
        last_time = current_time;
        last_temp_count = get_rc16m_count();
        #if (LUT_PATCH_ENABLED)
        pll_vcocal_LUT_InitUpdate(LUT_UPDATE);    //Update pll look up table
        #endif

        #if (LUT_PATCH_ENABLED)
        rf_cal_stat = rf_calibration_580();
        #else
        rf_cal_stat = rf_calibration_585();
        #endif

        if ( rf_cal_stat == false)
            force_rf_cal = 1;

        return;
    }

    if ( (current_time - last_time) >= 3200) //2 sec
    {
        last_time = current_time;
        count = get_rc16m_count();                  // Estimate the RC16M frequency

        if (count > last_temp_count)
            count_diff = count - last_temp_count;
        else
            count_diff = last_temp_count - count ;

        if (count_diff >= 24)// If corresponds to 5 C degrees difference
        {

            // Update the value of last_count
            last_temp_count = count;
            #if (LUT_PATCH_ENABLED)
            pll_vcocal_LUT_InitUpdate(LUT_UPDATE);    //Update pll look up table
            #endif

            #if (LUT_PATCH_ENABLED)
            rf_cal_stat = rf_calibration_580();
            #else
            rf_cal_stat = rf_calibration_585();
            #endif

            if ( rf_cal_stat == false)
                force_rf_cal = 1;         // Perform the radio calibrations
        }
    }
#endif
#endif // __FPGA__
}

/**
 ****************************************************************************************
 * @brief       Converts us to low power cycles for RCX20 clock.
 *
 * @param[in]   us. microseconds
 *
 * @return      uint32_t. Low power cycles
 ****************************************************************************************
 */
uint32_t lld_sleep_us_2_lpcycles_rcx_func(uint32_t us)
{
    uint32_t lpcycles = 0;

    lpcycles = (us * rcx_time_data.rcx_freq + 500000) / 1000000;

    return(lpcycles);
}

/**
 ****************************************************************************************
 * @brief       Converts low power cycles to us for RCX20 clock.
 *
 * @param[in]   lpcycles. Low power cycles
 *
 * @return      uint32_t. microseconds
 ****************************************************************************************
 */
uint32_t lld_sleep_lpcycles_2_us_rcx_func(uint32_t lpcycles)
{
    uint32_t us = 0;

    // Sanity check: The number of lp cycles should not be too high to avoid overflow
    ASSERT_ERR(lpcycles < 1000000);

    if (lpcycles >= 0x8000) {
        // lpcycles MUST be very large!
        uint64_t res = (uint64_t)lpcycles * rcx_time_data.rcx_period;
        us = res >> 10;
    }
    else {
        us = (lpcycles * rcx_time_data.rcx_period) >> 10;
    }

    return(us);
}

uint32_t lld_sleep_us_2_lpcycles_sel_func(uint32_t us)
{
    uint32_t lpcycles = 0;

    if ( arch_clk_is_XTAL32( ) )
        lpcycles = lld_sleep_us_2_lpcycles_func(us);
    else if ( arch_clk_is_RCX20( ) )
        lpcycles = lld_sleep_us_2_lpcycles_rcx_func(us);

    return(lpcycles);
}

uint32_t lld_sleep_lpcycles_2_us_sel_func(uint32_t lpcycles)
{
    uint32_t us = 0;

    if ( arch_clk_is_XTAL32( ) )
        us = lld_sleep_lpcycles_2_us_func(lpcycles);
    else  if ( arch_clk_is_RCX20() )
        us = lld_sleep_lpcycles_2_us_rcx_func(lpcycles);

    return(us);
}


#if (!BLE_APP_PRESENT)

bool check_gtl_state(void)
{
    bool ret = true;

    if (use_h4tl & 0x01)
    {
        if ((h4tl_env.tx_state != H4TL_STATE_TX_IDLE)||
            ((h4tl_env.rx_state != H4TL_STATE_RX_START) &&
            (h4tl_env.rx_state != H4TL_STATE_RX_OUT_OF_SYNC)) )
            ret = false;
    }
    else
    {
        if ((ke_state_get(TASK_GTL) != GTL_TX_IDLE) ||
            ((gtl_env.rx_state != GTL_STATE_RX_START) &&
            (gtl_env.rx_state != GTL_STATE_RX_OUT_OF_SYNC)) )
            ret = false;
    }

    return ret;
}
#endif

#if ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT)) // only in full embedded designs
void ext_wakeup_enable(uint32_t port, uint32_t pin, uint8_t polarity)
{
    rwip_env.ext_wakeup_enable = 2;
    if (DEVELOPMENT_DEBUG)
        RESERVE_GPIO(EXT_WAKEUP_GPIO, (GPIO_PORT) port, (GPIO_PIN) pin, PID_GPIO);

    if ( polarity == 0 ) // active low
        GPIO_ConfigurePin((GPIO_PORT) port, (GPIO_PIN) pin, INPUT_PULLUP, PID_GPIO, false ); // active low. Set default to input high.
    else // active high
        GPIO_ConfigurePin((GPIO_PORT) port, (GPIO_PIN) pin, INPUT_PULLDOWN, PID_GPIO, false); // active high. Set default to input low.

    wkupct_register_callback(ext_wakeup_cb);

    wkupct_enable_irq(WKUPCT_PIN_SELECT((GPIO_PORT) port, (GPIO_PIN) pin), // Select pin
                      WKUPCT_PIN_POLARITY((GPIO_PORT) port, (GPIO_PIN) pin, (polarity == 0) ? WKUPCT_PIN_POLARITY_LOW : WKUPCT_PIN_POLARITY_HIGH), // Polarity
                      1, // 1 event
                      0); // debouncing time = 0
}

void ext_wakeup_disable(void)
{
    wkupct_disable_irq();
}

void ext_wakeup_resume_from_sleep(void)
{
}

void ext_wakeup_cb(void)
{
#if !defined (__DA14531__)
    if (GetBits16(SYS_STAT_REG, PER_IS_DOWN))
    {
        // Return GPIO functionality from external wakeup GPIO
        if (DEVELOPMENT_DEBUG)
            GPIO_reservations();
        set_pad_functions();
    }
#endif
    SetBits32(GP_CONTROL_REG, BLE_WAKEUP_REQ, 1);
}
#endif // ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT))

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
uint8_t check_sys_startup_period(void)
{
    return check_sys_startup_period_ROM(&sys_startup_flag, startup_sleep_delay);
}
#else
uint8_t check_sys_startup_period(void)
{
    uint8_t ret_value = 0;

    if (sys_startup_flag)
    {
        uint32_t current_time;

        current_time = lld_evt_time_get();

        // startup_sleep_delay after system startup to allow system to sleep
        if (current_time < startup_sleep_delay)
        {
            ret_value = 1;
        }
        else // After 2 seconds system can sleep
        {
            sys_startup_flag = false;
        }
    }
    return ret_value;
}
#endif // __EXCLUDE_ROM_ARCH_SYSTEM__

__WEAK bool app_use_lower_clocks_check(void)
{
    return false;
}

void lld_sleep_init_func(void)
{
    /// ROM struct definition
    struct lld_sleep_env_tag
    {
        uint32_t irq_mask;
    };
    extern struct lld_sleep_env_tag lld_sleep_env;


    // Clear the environment
    memset(&lld_sleep_env, 0, sizeof(lld_sleep_env));

    // Set wakeup_delay
    set_sleep_delay();

    // Enable external wake-up by default
    ble_extwkupdsb_setf(0);
}

void arch_wkupct_tweak_deb_time(bool tweak)
{
    if (arch_clk_is_RCX20())
    {
        if (tweak)
        {
            // Recalculate debouncing time to correct silicon bug
            uint32_t temp = (rcx_time_data.rcx_freq * arch_wkupct_deb_time) / 32768;
            SetBits16(WKUP_CTRL_REG, WKUP_DEB_VALUE, temp & 0x3F);
        }
        else
        {
            SetBits16(WKUP_CTRL_REG, WKUP_DEB_VALUE, arch_wkupct_deb_time & 0x3F);
        }
    }
}
#endif // (__NON_BLE_EXAMPLE__)

