sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
/*
 * Non BLE specific code
 */

#if defined (__DA14531__)
void arch_set_pxact_gpio(GPIO_PORT port, GPIO_PIN pin)
{
#if (DEVELOPMENT_DEBUG)
    uint32_t data_reg = GPIO_BASE + (port << 5);
    uint32_t mode_reg = data_reg + 0x6 + (pin << 1);
    uint32_t set_data_reg = data_reg + 2;
    uint32_t reset_data_reg = data_reg + 4;

    SetWord16(mode_reg, (uint16_t)PID_GPIO | (uint16_t)OUTPUT);
    SetWord16(set_data_reg, 1 << pin);
    arch_asm_delay_us(47);    // wait for 47 us
    SetWord16(reset_data_reg, 1 << pin);
#endif
}
#else

void arch_set_pxact_gpio(void)
{
#if (DEVELOPMENT_DEBUG)
    SetWord16(P13_MODE_REG, (uint16_t)PID_GPIO|(uint16_t)OUTPUT);
    SetWord16(P1_SET_DATA_REG, 0x8);
    arch_asm_delay_us(47);    // wait for 47 us
    SetWord16(P1_RESET_DATA_REG, 0x8);
#endif
}
#endif

#if defined (__DA14531__)
void set_xtal32m_trim_value(uint16_t trim_value)
{
    clk_freq_trim_reg_value = trim_value;

#if (defined (__DA14531_01__) || defined (__DA14535__)) && !defined (__EXCLUDE_ROM_ARCH_SYSTEM__)
    set_xtal32m_trim_value_ROM(trim_value);
#else
    SetBits16(CLK_RC32M_REG, RC32M_DISABLE, 0);                     // enable RC32M
    arch_asm_delay_us(13);

    SetBits16(CLK_CTRL_REG, SYS_CLK_SEL, 1);                        // switch to RC32M
    while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_RC32M) == 0 );     // wait for actual switch

    SetWord16(CLK_FREQ_TRIM_REG, trim_value);                       // set default trim value
    arch_asm_delay_us(1000);                                        // wait for 1 ms

    SetBits16(CLK_CTRL_REG , SYS_CLK_SEL ,0);                       // switch to XTAL32M
    while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_XTAL32M) == 0 );   // wait for actual switch
#endif // __EXCLUDE_ROM_ARCH_SYSTEM__
}
#else
void set_xtal16m_trim_value(uint16_t trim_value)
{
    clk_freq_trim_reg_value = trim_value;

    SetBits16(CLK_16M_REG, RC16M_ENABLE, 1);                        // enable RC16M
    arch_asm_delay_us(13);

    SetBits16(CLK_CTRL_REG, SYS_CLK_SEL, 1);                        // switch to RC16M
    while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_RC16M) == 0 );     // wait for actual switch

    SetWord16(CLK_FREQ_TRIM_REG, trim_value);                       // set default trim value
    arch_asm_delay_us(1000);                                        // wait for 1 ms

    SetBits16(CLK_CTRL_REG , SYS_CLK_SEL ,0);                       // switch to XTAL16M
    while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_XTAL16M) == 0 );   // wait for actual switch
}
#endif

#if defined (__DA14531__)
void xtal32m_configuration(void)
{
  #if defined (__DA14535__)
    SetBits16(XTAL32M_CTRL0_REG, CORE_AMPL_REG_NULLBIAS, 1);
  #else
    SetBits16(TRIM_CTRL_REG, XTAL_TRIM_SELECT, 2);  // only CLK_FREQ_TRIM_REG will be used for XTAL32M trimming
    SetBits16(XTAL32M_START_REG, XTAL32M_START, 0);
    SetBits16(XTAL32M_CTRL0_REG, CORE_CUR_SET, 1);
    SetBits16(XTAL32M_CTRL0_REG, CORE_AMPL_TRIM, 5);
  #endif
}
#endif

#if defined (__DA14531__)
/**
 ****************************************************************************************
 * @brief Check if XTAL32M clock is calibrated. If not, set the trimming value to
 *        the default one.
 ****************************************************************************************
 */
__STATIC_INLINE void xtal32m_calibration_check(void)
{
    // Apply the XTAL32M trim value
    set_xtal32m_trim_value(otp_cs_get_xtal32m_trim_value());
}
#else
/**
 ****************************************************************************************
 * @brief Check if XTAL16M clock is calibrated. If not, set the trimming value to
 *        the default one.
 ****************************************************************************************
 */
__STATIC_INLINE void xtal16m_calibration_check(void)
{
    // Get the trim value stored from the booter
    uint16_t trimvalue = GetWord16(CLK_FREQ_TRIM_REG);
#if (DEFAULT_XTAL16M_TRIM_VALUE_USED)
    // Apply the default XTAL16M trim value, if a trim value has not been programmed in OTP.
    // The booter will not apply any trim value to CLK_FREQ_TRIM_REG if the respective OTP
    // entry contains a zero value (a blank OTP contains zeros in DA14585/586).
    // The reset value of CLK_FREQ_TRIM_REG is zero as well.
    if (trimvalue == 0)
    {
        trimvalue = DEFAULT_XTAL16M_TRIM_VALUE;
    }
#endif
    set_xtal16m_trim_value(trimvalue);
}
#endif

void arch_system_init_vdd_clamp_for_rcx(void)
{
#if defined (__DA14535__)
    // Enable LDO_CORE_RET
    SetBits16(POWER_CTRL_REG, LDO_CORE_RET_ENABLE, 1);
    
    arch_asm_delay_us(300);
    SetBits16(POWER_LEVEL_REG, FORCE_RCX_LDO_CORE_RET, 0x1);
    
    // Set default clamp voltage value
    SetBits16(POWER_AON_CTRL_REG, LDO_RET_TRIM, PREF_LDO_RET_TRIM_VAL);
#elif defined (__DA14531__)
    // Set default clamp voltage value
    SetBits16(POWER_AON_CTRL_REG, LDO_RET_TRIM, PREF_LDO_RET_TRIM_VAL);

    // Enable LDO_CORE_RET
    SetBits16(POWER_CTRL_REG, LDO_CORE_RET_ENABLE, 1);
#else
#endif
}

/*
 * System initialization
 */

void system_init(void)
{
    // Initialize the Watchdog unit
    wdg_init(USER_WDG_CFG);

#if (USE_RANGE_EXT)
    // Register range extender driver API
    range_ext_init(&range_ext);
#endif

    // Initialize the GPIOs
    GPIO_init();

#if defined (__DA14531__)
    // Get the reason of reset
    volatile uint16_t reset_stat = GetWord16(RESET_STAT_REG);

    // Notify application
    reset_indication(reset_stat);

    // Check if the system woke up from hibernation
    // Booter performs a SW reset to execute the software, so in this case
    // SWRESET_STAT is set.
    if ((reset_stat & (~SWRESET_STAT)) == 0)
    {
        // This is a wakeup from hibernation
        // Disable Hibernation
        SetBits16(HIBERN_CTRL_REG, HIBERNATION_ENABLE, 0);
    }
    else
    {
        // This is a wakeup from reset (POR, HW or watchdog)
        // Clear RESET_STAT_REG to be ready for next time
        SetWord16(RESET_STAT_REG, 0);
    }
#else
    // Provide the value of POR_TIMER_REG to the function to determine
    // whether the system woke up from deep sleep (hard reset will be issued after
    // wake up) or did a power cycle:
    // Deep sleep wake up: The user must initialize the POR_TIMER_REG
    // to a value different than the reset one. The POR_TIMER_REG is retained
    // during deep sleep.
    // Power cycle (either through power supply on/off or power on reset):
    // The POR_TIMER_REG will be set to its reset value.
    reset_indication(GetWord16(POR_TIMER_REG));
#endif

