sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
    arch_system_init_vdd_clamp_for_rcx();

#if defined (__DA14531__)
    // Settings extracted from `set_recommended_settings()`
    SetBits16(DCDC_CTRL_REG, DCDC_CLK_DIV, 0x0);
    SetBits16(POWER_AON_CTRL_REG, FORCE_RUNNING_COMP_DIS, 0x1);
    SetBits16(POWER_CTRL_REG, POR_VBAT_HIGH_HYST_DIS, 0);    // Sets the POR VBAT HIGH threshold at 1.66V
    SetBits16(POWER_LEVEL_REG, LDO_LOW_TRIM, 3);

    // Perform the following steps when in Boost (or Bypass) mode
    if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED))
    {
        SetBits16(DCDC_CTRL_REG, DCDC_ILIM_MIN, 0x4);
        // Set ILIM_MAX to half its maximum value to limit inrush current
        // during wake-up or cold boot for high-ohmic batteries.
        SetBits16(DCDC_CTRL_REG, DCDC_ILIM_MAX, 0x8);

        // Disable the POR triggered from VBAT_HIGH voltage level sensing
        SetBits16(POWER_AON_CTRL_REG, POR_VBAT_HIGH_RST_MASK, 1);

        // Enable the POR triggered from VBAT_LOW voltage level sensing
        SetBits16(POWER_AON_CTRL_REG, POR_VBAT_LOW_RST_MASK, 0);

        // Disable the DC/DC. It has been left enabled by the booter.
        // - It has to be enabled for OTP access and GPIOs.
        SetBits16(DCDC_CTRL_REG, DCDC_ENABLE, 0);

#if defined (__DA14535__)
        // Do not charge VBAT_HIGH in boost mode
        SetBits16(POWER_AON_CTRL_REG, CHARGE_VBAT_DISABLE, 1);
#else
        // Charge VBAT_HIGH in boost mode
        SetBits16(POWER_AON_CTRL_REG, CHARGE_VBAT_DISABLE, 0);
#endif
    }
    // Perform the following steps, when in Buck mode
    else
    {
        SetBits16(DCDC_CTRL_REG, DCDC_ILIM_MIN, 0x6);
        SetBits16(DCDC_CTRL_REG, DCDC_ILIM_MAX, 0xF);

        // Enable the POR triggered from VBAT_HIGH voltage level sensing
        SetBits16(POWER_AON_CTRL_REG, POR_VBAT_HIGH_RST_MASK, 0);

        // Enable the POR triggered from VBAT_LOW voltage level sensing
        SetBits16(POWER_AON_CTRL_REG, POR_VBAT_LOW_RST_MASK, 0);

        // Set DC/DC level to 1.1V (1.2V for DA14535)
        SetBits16(POWER_LEVEL_REG, DCDC_LEVEL, 0);

#if defined (__DA14535__)
        // Setting extracted from `set_recommended_settings()`
        SetBits16(POWER_LEVEL_REG, DCDC_TRIM, 0x3);
#endif

        // Enable the DC/DC
        SetBits16(DCDC_CTRL_REG, DCDC_ENABLE, 1);

        while(GetBits16(ANA_STATUS_REG, DCDC_OK) != 1);
    }

    // Connection between VBAT_HIGH and VBAT_LOW: Automatic connection control
    SetBits16(POWER_AON_CTRL_REG, VBAT_HL_CONNECT_RES_CTRL, 3);

    // Turn off LDO_LOW.
    // - Boost (or Bypass) mode: It must be turned off always.
    // - Buck mode (DA14531): It must be turned off in active mode, since the
    //                        DC/DC is selected to supply VBAT_LOW by default.
    //                        It must be turned on during sleep mode. Hence, it
    //                        must be turned on as late as possible before
    //                        going to sleep.
    // - Buck mode (DA14535): It must be turned off , since the DC/DC is
    //                        selected to supply VBAT_LOW by default, in active
    //                        and sleep modes.
    SetBits16(POWER_CTRL_REG, LDO_LOW_CTRL_REG, 1);

#if !defined (__DA14535__)
    // Set for proper RCX operation
    SetBits16(GP_DATA_REG, FORCE_RCX_VDD | FORCE_RCX_VREF, 1);
#endif
#endif

#if !defined (__NON_BLE_EXAMPLE__)
    sys_startup_flag = true;
#endif

#if !defined (__DA14531__)
    // Disable DC-DC converter automatic calibration (buck or boost mode)
    SetBits16(DCDC_CTRL2_REG, DCDC_AUTO_CAL, 0);

    if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 0x1)
    {
        // Register settings applied when in boost mode
        SetBits16(DCDC_CTRL2_REG, DCDC_VOLT_LEV, 0xA); // 1.45V
        SetBits16(DCDC_CTRL2_REG, DCDC_CUR_LIM, 0x8);  // 80mA
    }
#endif

#if defined (__DA14531__)
    xtal32m_configuration();
#else
    // Confirm XTAL16M calibration
    xtal16m_calibration_check();
#endif

    // Set the system clocks (rom function call)
#if !defined (__DA14531__)
    SetBits16(CLK_16M_REG, RC16M_ENABLE, 0);
#endif

#if defined (__DA14531__)
    #if (DISABLE_QUADEC_ON_START_UP)
        // Clear quadec pending interrupt - mask quadec interrupt
        SetWord16(QDEC_CTRL_REG, QDEC_IRQ_STATUS);

        // Close peripheral clock
        SetBits16(CLK_PER_REG, QUAD_ENABLE, 0);

        // Clear respective NVIC entry
        NVIC_ClearPendingIRQ(WKUP_QUADEC_IRQn);
    #endif
#endif

    // Initialize OTP controller
    hw_otpc_init();

#if defined (__DA14531__)
    hw_otpc_enter_mode(HW_OTPC_MODE_READ);
#else
    hw_otpc_manual_read_on(false);
#endif

#if defined (__DA14531__)
#if !defined (__FPGA__)
    uint8_t dbg_cfg = (GetWord32(OTP_HDR_PACKAGE_ADDR) & 0xFF) == PACKAGE_QFN_24 ? SWD_DATA_AT_P0_10 : SWD_DATA_AT_P0_5;
#else
    uint8_t dbg_cfg = SWD_DATA_AT_P0_1;
#endif

    // Store default debugger configuration
    syscntl_store_debugger_cfg(dbg_cfg);

    __WEAK void sb_read_otp_header(void);
    // Used only by the secondary bootloader application
    sb_read_otp_header();
#endif

#if !defined (__NON_BLE_EXAMPLE__)
    // Read BD device address
    otp_hdr_get_bd_address((uint8_t *) &dev_bdaddr);

#if !defined (__DA14531__)
    // Read IQ trim values
    iq_trim_bias_ctrl1_reg = GetWord16(OTP_HDR_IQ_TRIM_VALUE_ADDR);
    iq_trim_rf_mixer_ctrl1_reg = GetWord16(OTP_HDR_IQ_TRIM_VALUE_ADDR + 2);
#endif
#endif // (__NON_BLE_EXAMPLE__)

#if defined (__DA14531__)
    // Store OTP Configuration Script values to retention memory
    otp_cs_store();

    // Confirm XTAL32M calibration
    xtal32m_calibration_check();

#if !defined (__NON_BLE_EXAMPLE__)
    rf_cal_last_temp = 127;
#if (USE_XTAL32M_DYN_FREQ_TRIMMING)
    xtal32m_trim_last_temp = 127;
#endif
#endif
#endif

    // Read low power clock source from OTP
#if defined (CFG_LP_CLK) && (CFG_LP_CLK == LP_CLK_FROM_OTP)
    store_low_power_clock();
#endif

#if defined (__DA14531__) && (USE_TRNG)
    otp_hdr_timestamp = GetWord32(OTP_HDR_TIMESTAMP_ADDR);
#endif

    hw_otpc_disable();
    
#if defined (__DA14533__)
    // Setting extracted from `set_recommended_settings()`
    SetBits16(GP_ADC_CTRL3_REG, GP_ADC_EN_DEL, 0x50);
#endif

#if !defined (__NON_BLE_EXAMPLE__)
    // Initialize ROM variables
    arch_rom_init();
#endif // (__NON_BLE_EXAMPLE__)

#if defined (__DA14586__)
    power_down_da14586_flash();
#endif

    // Peripheral initialization
    periph_init();

#if !defined (__NON_BLE_EXAMPLE__)

    // Clock initialization
    init_pwr_and_clk_ble();

    // Create seed with TRNG mechanism and feed it to random number generator function
#if (USE_TRNG)
    init_rand_seed_from_trng();
#endif

