sriharimaddula/ble-sdk6-examples/SDK_6.0.24.1464/DA145xx_SDK/6.0.24.1464/sdk/platform/arch/main/arch_system.c
    /*
     ************************************************************************************
     * BLE initialization
     ************************************************************************************
     */
    ble_init(_ble_base);

#if (USE_RANGE_EXT)
    // Enable range extender
    range_ext.enable(MAX_POWER, NULL);
#endif

    // Disable sleep and external wake up. We have to do this because rwip_init() sets them both to true.
    rwip_env.sleep_enable = false;
    rwip_env.ext_wakeup_enable = false;

    //Enable the BLE core
    SetBits32(BLE_RWBLECNTL_REG, RWBLE_EN, 1);

#ifdef DG_DBG_DIAG_PORT
    dbg_init_diag_port();
#endif

    rcx20_calibrate();

    arch_disable_sleep();

    /*
     ************************************************************************************
     * Application initializations
     ************************************************************************************
     */
    // Initialise APP

#if (BLE_APP_PRESENT)
    app_init();         // Initialize APP
#endif

     if (user_app_main_loop_callbacks.app_on_init !=NULL)
          user_app_main_loop_callbacks.app_on_init();

    //Initialise lld_sleep
    lld_sleep_init_func();

#if (USE_XTAL16M_ADAPTIVE_SETTLING && USE_POWER_OPTIMIZATIONS)
    twirq_set_min = TWIRQSET_MIN_XTAL32_TICKS;
    twirq_set_max = TWIRQSET_MAX_XTAL32_TICKS;
    twirq_set     = TWIRQSET_INIT_XTAL32_TICKS;
#endif

#endif // (__NON_BLE_EXAMPLE__)

#if !defined (__DA14531__)
    xtal16m_trim_init();
#endif

#if !defined (__NON_BLE_EXAMPLE__)
#if defined (CFG_RF_DIAG_INT)
    // Enable RF DIAG interrupts
    enable_rf_diag_irq(RF_DIAG_IRQ_MODE_RXTX);
#endif
#endif

#if !defined (__NON_BLE_EXAMPLE__)
    /*
     ************************************************************************************
     * Watchdog start
     ************************************************************************************
     */
#if (USE_WDOG)
    wdg_reload(WATCHDOG_DEFAULT_PERIOD);
    wdg_resume ();
#endif
#endif
}

#if !defined (__NON_BLE_EXAMPLE__)
// Use ROM 'gap_cfg_user_var_struct symbol' only for DA14531, DA14531-01, DA14535 and ROM SDK combination
#if !defined (__DA14531__) || defined (__EXCLUDE_ROM_GAP_CFG_DATA__)
const struct gap_cfg_user_struct gap_cfg_user_var_struct =
{
    .GAP_TMR_LECB_DISCONN_TIMEOUT_VAR=0x0BB8,
    .GAP_APPEARANCE_VAR=0x0000,
    .GAP_PPCP_CONN_INTV_MAX_VAR=0x0064,
    .GAP_PPCP_CONN_INTV_MIN_VAR=0x00c8,
    .GAP_PPCP_SLAVE_LATENCY_VAR=0x0000,
    .GAP_PPCP_STO_MULT_VAR=0x07d0,
    .GAP_TMR_LIM_ADV_TIMEOUT_VAR=0x4650,
    .GAP_TMR_GEN_DISC_SCAN_VAR=0x0300,
    .GAP_TMR_LIM_DISC_SCAN_VAR=0x0300,
    .GAP_TMR_PRIV_ADDR_INT_VAR=0x3A98,
    .GAP_TMR_CONN_PAUSE_CT_VAR=0x0064,
    .GAP_TMR_CONN_PAUSE_PH_VAR=0x01F4,
    .GAP_TMR_CONN_PARAM_TIMEOUT_VAR=0x0BB8,
    .GAP_TMR_LECB_CONN_TIMEOUT_VAR=0x0BB8,
    .GAP_TMR_SCAN_FAST_PERIOD_VAR=0x0C00,
    .GAP_TMR_ADV_FAST_PERIOD_VAR=0x0BB8,
    .GAP_LIM_DISC_SCAN_INT_VAR=0x0012,
    .GAP_SCAN_FAST_INTV_VAR=0x0030,
    .GAP_SCAN_FAST_WIND_VAR=0x0030,
    .GAP_SCAN_SLOW_INTV1_VAR=0x00CD,
    .GAP_SCAN_SLOW_INTV2_VAR=0x019A,
    .GAP_SCAN_SLOW_WIND1_VAR=0x0012,
    .GAP_SCAN_SLOW_WIND2_VAR=0x0024,
    .GAP_ADV_FAST_INTV1_VAR=0x0030,
    .GAP_ADV_FAST_INTV2_VAR=0x0064,
    .GAP_ADV_SLOW_INTV_VAR=0x00B0,
    .GAP_INIT_CONN_MIN_INTV_VAR=0x0018,
    .GAP_INIT_CONN_MAX_INTV_VAR=0x0028,
    .GAP_INQ_SCAN_INTV_VAR=0x0012,
    .GAP_INQ_SCAN_WIND_VAR=0x0012,
    .GAP_CONN_SUPERV_TIMEOUT_VAR=0x07D0,
    .GAP_CONN_MIN_CE_VAR=0x0000,
    .GAP_CONN_MAX_CE_VAR=0xFFFF,
    .GAP_CONN_LATENCY_VAR=0x0000,
    //.GAP_LE_MASK_VAR=0x1F,
    .GAP_MAX_LE_MTU_VAR=512,
#if defined (__DA14586__)
    .GAP_DEV_NAME_VAR="DA14586",
#elif defined (__DA14531_01__)
    .GAP_DEV_NAME_VAR="DA14531-01",
#elif defined (__DA14535__)
    .GAP_DEV_NAME_VAR="DA14535",
#elif defined (__DA14531__)
    .GAP_DEV_NAME_VAR="DA14531",
#else
    .GAP_DEV_NAME_VAR="DA14585",
#endif
};
#endif
#endif // (__NON_BLE_EXAMPLE__)

/// @}
